# Parameters
nc: 5  # number of classes (小汽车、卡车、巴士、行人、两轮车)
scales:
  n: [0.33, 0.25, 1024]  # YOLOv8n 的深度、宽度、最大通道数

# Backbone with CBAM
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]    # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]    # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]    # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]   # 8
  - [-1, 1, CBAM, [1024]]        # 9  # 在 Backbone 末端加入 CBAM
  - [-1, 1, SPPF, [1024, 5]]    # 10

# Head with P2-P5
head:
  # 上采样分支（P5 -> P4 -> P3 -> P2）
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4 (12)
  - [-1, 3, C2f, [512]]         # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3 (15)
  - [-1, 3, C2f, [256]]         # 16 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 17
  - [[-1, 2], 1, Concat, [1]]  # cat backbone P2 (18)
  - [-1, 3, C2f, [128]]         # 19 (P2/4-xsmall)

  # 下采样分支（P2 -> P3 -> P4 -> P5）
  - [-1, 1, Conv, [128, 3, 2]]  # 20
  - [[-1, 16], 1, Concat, [1]]  # cat head P3 (21)
  - [-1, 3, C2f, [256]]         # 22 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]  # 23
  - [[-1, 13], 1, Concat, [1]]  # cat head P4 (24)
  - [-1, 3, C2f, [512]]         # 25 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]  # 26
  - [[-1, 10], 1, Concat, [1]]  # cat head P5 (27)
  - [-1, 3, C2f, [1024]]        # 28 (P5/32-large)

  # 检测头（P2, P3, P4, P5）
  - [[19, 22, 25, 28], 1, Detect, [nc]]  # Detect(P2, P3, P4, P5) 添加P2小目标检测头