# YOLOv8n with CBAM + EMA
# Parameters
nc: 80  # 类别数（COCO标准）
scales:
  n: [0.33, 0.25, 1024]

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]    # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]   # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]   # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, CBAM, [256]]         # CBAM@P3（增强浅层空间+通道注意力）
  - [-1, 1, Conv, [512, 3, 2]]   # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, EMAttention, [512]]          # EMA@P4（多尺度特征融合）
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, CBAM, [1024]]        # CBAM@P5（强化高层特征）
  - [-1, 1, EMAttention, [1024]]         # EMA@P5
  - [-1, 1, SPPF, [1024, 5]]     # 12

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 8], 1, Concat, [1]]    # cat P4（注意索引调整）
  - [-1, 3, C2f, [512]]
  - [-1, 1, EMAttention, [512]]          # EMA@Neck-P4

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]    # cat P3
  - [-1, 3, C2f, [256]]
  - [-1, 1, CBAM, [256]]         # CBAM@Neck-P3

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]   # cat P4
  - [-1, 3, C2f, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]   # cat P5
  - [-1, 3, C2f, [1024]]

  - [[18, 21, 24], 1, Detect, [nc]]  # Detect(P3, P4, P5)