# YOLOv8n with CoordAttention + ShuffleAttention and P2-P5 outputs
nc: 5  # 根据实际任务调整类别数
scales:
  n: [0.33, 0.25, 1024]  # depth, width, max_channels

backbone:
  # 初始卷积层 (P1/2 to P5/32)
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]   # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]   # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]   # 6-P4/16
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]  # 8-P5/32
  - [-1, 1, CoordAtt, [1024]]   # 9-CoordAttention @ P5
  - [-1, 1, SPPF, [1024, 5]]    # 10-SPPF

head:
  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 11
  - [[-1, 6], 1, Concat, [1]]  # 12-cat P4
  - [-1, 3, C2f, [512]]        # 13
  - [-1, 1, ShuffleAttention, [512]]  # 14-ShuffleAttention @ P4

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 15
  - [[-1, 4], 1, Concat, [1]]  # 16-cat P3
  - [-1, 3, C2f, [256]]        # 17
  - [-1, 1, ShuffleAttention, [256]]  # 18-ShuffleAttention @ P3

  # P3 -> P2 (新增P2分支)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 19
  - [[-1, 2], 1, Concat, [1]]  # 20-cat P2
  - [-1, 3, C2f, [128]]        # 21 (P2/4-xsmall)

  # 下采样路径 (P2 -> P5)
  - [-1, 1, Conv, [128, 3, 2]]  # 22
  - [[-1, 17], 1, Concat, [1]]  # 23-cat P3
  - [-1, 3, C2f, [256]]         # 24

  - [-1, 1, Conv, [256, 3, 2]]  # 25
  - [[-1, 13], 1, Concat, [1]]  # 26-cat P4
  - [-1, 3, C2f, [512]]         # 27

  - [-1, 1, Conv, [512, 3, 2]]  # 28
  - [[-1, 10], 1, Concat, [1]]  # 29-cat P5
  - [-1, 3, C2f, [1024]]        # 30

  # 检测头 (P2, P3, P4, P5)
  - [[21, 24, 27, 30], 1, Detect, [nc]]  # Detect(P2, P3, P4, P5)