# YOLOv8n with CBAM + ECA
# Parameters
nc: 5  # 类别数（根据实际任务调整）
scales:
  n: [0.33, 0.25, 1024]  # depth, width, max_channels

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, ECA, [256]]         # ECA @ P3（轻量级通道注意力）
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, CBAM, [512]]        # CBAM @ P4（空间+通道注意力）
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, CBAM, [1024]]       # CBAM @ P5（强化高层特征）
  - [-1, 1, SPPF, [1024, 5]]    # 10

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 7], 1, Concat, [1]]   # cat P4（注意索引调整）
  - [-1, 3, C2f, [512]]
  - [-1, 1, ECA, [512]]         # ECA @ Neck-P4

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]   # cat P3
  - [-1, 3, C2f, [256]]
  - [-1, 1, ECA, [256]]         # ECA @ Neck-P3

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]  # cat P4
  - [-1, 3, C2f, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]  # cat P5
  - [-1, 3, C2f, [1024]]

  - [[17, 20, 23], 1, Detect, [nc]]  # Detect(P3, P4, P5)